Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоНепереданногоФД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСменыККТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассаБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНепереданныхФД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоФД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаСрочнаяЗаменаФН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПамятьФНПереполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПревышеноВремяОжиданияОтветаОФД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсФНИсчерпан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФДОЗакрытииСмены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ИспользоватьПоУмолчаниюВебКасса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияWebKassaВызовСервераПереопределяемый/Ext/Module.bsl
#Область Прочее

// Функция возвращает список касс ККМ
//
Функция ПолучитьСписокКассККМ(ПодключаемоеОборудование) Экспорт

	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	СписокКассККМ = Новый Массив();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка,
	|	КассыККМ.Наименование
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.РабочееМесто = &РабочееМесто
	|	И КассыККМ.ПодключаемоеОборудование = &ПодключаемоеОборудование
	|	И КассыККМ.ПометкаУдаления = Ложь");
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ПодключаемоеОборудование", ПодключаемоеОборудование);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КассаККМ = Новый Структура;
		КассаККМ.Вставить("Ссылка",      Выборка.Ссылка);
		КассаККМ.Вставить("Наименование",Выборка.Наименование);
		СписокКассККМ.Добавить(КассаККМ);
	КонецЦикла;
	
	Возврат СписокКассККМ;
	
КонецФункции

// Функция возвращает сведения об организации
//
Функция ПолучитьСведенияОбОрганизации(Организация, ДатаПериода) Экспорт
	
	Сведения = Новый Структура("Представление, 
	|ПолноеНаименование, 
	|КодПоОКПО, 
	|РНН, 
	|БИН_ИИН,
	|КБЕ,  
	|Телефоны, 
	|ЮридическийАдрес, 
	|Банк, 
	|БИК, 
	|КоррСчет, 
	|НомерСчета, 
	|АдресБанка,
	|ДатаСвидетельстваПоНДС,
	|НомерСвидетельстваПоНДС,
	|СерияСвидетельстваПоНДС,
	|СвидетельствоПоНДС,
	|ЮрФизЛицо,
	|НомерРегистрацииВСтранеРезидентства,
	|СтранаРезидентства,
	|СтранаРезидентстваКод2,
	|СтранаРезидентстваУчастникТаможенногоСоюза,
	|КодОрганаГосударственныхДоходов");
	
	
	Сведения = Новый Структура; 
	Сведения.Вставить("КодПоОКПО",      Организация.КодПоОКПО);
	Сведения.Вставить("РНН",      Организация.РНН);
	Сведения.Вставить("КБЕ",      Организация.КБЕ);
	Сведения.Вставить("Банк",      Организация.ОсновнойБанковскийСчет.Банк);
	Сведения.Вставить("БИК",      Организация.ОсновнойБанковскийСчет.Банк.Код);
	Сведения.Вставить("НомерСчета",      Организация.ОсновнойБанковскийСчет);
	Сведения.Вставить("АдресБанка",      Организация.ОсновнойБанковскийСчет.Банк.Адрес);
	Сведения.Вставить("ДатаСвидетельстваПоНДС",      Организация.ДатаСвидетельстваПоНДС);
	Сведения.Вставить("СвидетельствоПоНДС",      Организация.НомерСвидетельстваПоНДС);
	Сведения.Вставить("ЮрФизЛицо",      Организация.ЮрФизЛицо);
	Сведения.Вставить("СтранаРезидентства",      Организация.СтранаРегистрации);
	Сведения.Вставить("Представление",      Организация);
	Сведения.Вставить("ПолноеНаименование", Организация);
	Сведения.Вставить("БИН_ИИН", Организация.ИНН);
	Сведения.Вставить("ИНН", Организация.ИНН);
	Сведения.Вставить("ГоловнаяОрганизация",Организация);
	Сведения.Вставить("СерияСвидетельстваПоНДС",Организация.СерияСвидетельстваПоНДС);
	Сведения.Вставить("НомерСвидетельстваПоНДС",Организация.НомерСвидетельстваПоНДС);
	Сведения.Вставить("ПризнакЮрЛица", Истина);  
	Сведения.Вставить("ЮридическийАдрес", Организация.ЮридическийАдрес);
	Возврат Сведения;
	
КонецФункции

// Функция возвращает параметры кассы ККМ
//
Функция ПолучитьРеквизитыКассы(КассаККМ) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ,"СерийныйНомер, РегистрационныйНомер, Наименование, Владелец");
	Реквизиты.Вставить("Кассир",ПолучитьКассираКассовойСмены(КассаККМ));
	Возврат Реквизиты;
	
КонецФункции

// Функция возвращает кассира для кассовой смены кассы ККМ
//
Функция ПолучитьКассираКассовойСмены(КассаККМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Кассир.Наименование КАК Кассир
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Кассир;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Функция возвращает сведения об организации и параметры кассы ККМ
//
Функция ПолучитьСведенияОбОрганизацииИКассеККМ(Организация, ДатаПериода, КассаККМ) Экспорт
	
	Если Организация=Неопределено Тогда 
		 Организация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ,"Владелец").Владелец;
	КонецЕсли;
	Сведения = ПолучитьСведенияОбОрганизации(Организация,ДатаПериода);
	РеквизитыКассыККМ = ПолучитьРеквизитыКассы(КассаККМ);
	Сведения.Вставить("СерийныйНомер",РеквизитыКассыККМ.СерийныйНомер);
	Сведения.Вставить("РегистрационныйНомер",РеквизитыКассыККМ.РегистрационныйНомер);
	Сведения.Вставить("Кассир",РеквизитыКассыККМ.Кассир);
	Сведения.Вставить("ОрганизацияСсылка",Организация);
	
	Возврат Сведения;
	
КонецФункции

// Функция возвращает сведения об организации и параметры кассы ККМ по документу
//
Функция ПолучитьСведенияОбОрганизацииИКассеККМПоДокументу(Документ, КассаККМ) Экспорт
	
	Возврат ПолучитьСведенияОбОрганизацииИКассеККМ(Документ.Организация, Документ.Дата, КассаККМ);
	
КонецФункции

// Функция возвращает параметры подключаемого оборудования
//
Функция ПолучитьСерийныйНомерУстройства(ПодключаемоеОборудование) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудование,"СерийныйНомер, ДрайверОборудования, РабочееМесто, Параметры");
	Возврат Реквизиты.СерийныйНомер;
	
КонецФункции

//Функция вызывает стандартную проверку, чтобы определить включена ли ф.о "Использовать подключаемое оборудование"
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Функция регистрирует новое подключаемое оборудование с драйвером 1С:WebKassa.
//
Функция СоздатьПодключаемоеОборудованиеWebkassa(Организация, Наименование = "", СерийныйНомер) Экспорт
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Организация)
		Или Не ЗначениеЗаполнено(СерийныйНомер) Тогда
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("АвтоматическаяПечатьЧека", Ложь);
	НовыеЗначениеПараметров.Вставить("ШиринаЛенты"             , Неопределено);
	//МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	НовоеОборудование = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
	НовоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор;
	НовоеОборудование.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверWebkassaФискальныеРегистраторы;
	НовоеОборудование.УстройствоИспользуется = Истина;
	НовоеОборудование.Организация = Организация;
	НовоеОборудование.Параметры = НовыеЗначениеПараметров;
	НовоеОборудование.РабочееМесто = РабочееМесто;
	НовоеОборудование.СерийныйНомер = СерийныйНомер;
	
	ШаблонНаименования = НСтр("ru = '''1С:WebKassa''- %1 (%2) на %3'");
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%1", Наименование);
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%2", СерийныйНомер);
	ШаблонНаименования = СтрЗаменить(ШаблонНаименования, "%3", РабочееМесто);
	НовоеОборудование.Наименование = ШаблонНаименования;
	Попытка
		НовоеОборудование.Записать();
		Результат = НовоеОборудование.Ссылка;
	Исключение
		Результат = Ложь;
		ТекстСообщения = НСтр("ru = 'Не удалось создать подключаемое оборудование по причине: %Причина%'", ОбщегоНазначения.КодОсновногоЯзыка()); // строка записывается в ИБ
		//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Организация);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ИнтеграцияWebKassaКлиентСервер.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			НовоеОборудование.Ссылка.Метаданные(), , ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьСерийныйНомерОборудования(Оборудование, НовыйСерийныйНомер) Экспорт
	
	Результат = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Оборудование.Ссылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Оборудование.Ссылка);
		Блокировка.Заблокировать();
		
		ОбъектДляОбработки = Оборудование.Ссылка.ПолучитьОбъект();
		Если ОбъектДляОбработки = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ОбъектДляОбработки.СерийныйНомер = НовыйСерийныйНомер;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектДляОбработки, Истина, Истина);
		
		ЗафиксироватьТранзакцию();
		
		Результат = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось серийный номер %Ссылка% по причине: %Причина%'", ОбщегоНазначения.КодОсновногоЯзыка()); // строка записывается в ИБ
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Оборудование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ИнтеграцияWebKassaКлиентСервер.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Оборудование.Ссылка.Метаданные(), Оборудование.Ссылка, ТекстСообщения);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНаименованиеЕдиницыИзмерения(КодЕдиницыИзмерения = "") Экспорт
	
	Результат = "";
	Если Не ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	//преобразуем значение в строку
	Если Число(КодЕдиницыИзмерения) < 1000 Тогда
		КодСтрокой = Формат(КодЕдиницыИзмерения, "ЧЦ=3; ЧВН=; ЧГ=");
	Иначе
		КодСтрокой = Формат(КодЕдиницыИзмерения, "ЧЦ=4; ЧВН=; ЧГ=");
	КонецЕсли;
	
	//ищем единицу измерения по справочнику
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Код = &Код
	|");
	Запрос.УстановитьПараметр("Код", КодСтрокой);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Результат = Выборка.Наименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Значение реквизита, прочитанного из информационной базы по ссылке на объект.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

// Возвращает макет печатной формы по полному пути к макету.
//
Функция ПолучитьМакетПечатнойФормы(ИмяМакета) Экспорт
	
	Возврат УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
КонецФункции

// Возвращает двоичные данные для формирования QR кода.
//
Функция ПолучитьQRКод(QRСтрока, УровеньКоррекции, Размер) Экспорт
	
	Возврат УправлениеПечатью.ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер);
	
КонецФункции

// Проверяет наличие у произвольного объекта реквизита с указанным именем.
//
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита);
	
КонецФункции

// Подставляет параметры в строку.
//
Функция ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметр1) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметр1);
	
КонецФункции

//Выводит сообщение пользователю
//
Процедура СообщитьПользователю(ТекстСообщения, Знач КлючДанных = Неопределено, Знач Поле = "", Знач ПутьКДанным = "") Экспорт
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		КлючДанных,
		Поле,
		ПутьКДанным);
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// Получает рабочее место клиента
//
Функция ПолучитьРабочееМестоКлиента() Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
КонецФункции

// Получает параметры идентификатора
//
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(Идентификатор);
	
КонецФункции

Функция ПолучитьИспользуемыеПринтерыЧеков() Экспорт
	
	Принтеры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДрайверыОборудования КАК ДрайверыОборудования
	|		ПО ПодключаемоеОборудование.ДрайверОборудования = ДрайверыОборудования.Ссылка
	|ГДЕ
	|	ДрайверыОборудования.ОбработчикДрайвера = &ОбработчикДрайвера";
	
	Запрос.УстановитьПараметр("ОбработчикДрайвера", Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикWebkassaФискальныеРегистраторы);
	
	ОбъектыДляОбработки = Запрос.Выполнить().Выбрать();
	
	Пока ОбъектыДляОбработки.Следующий() Цикл
		
		Попытка
			
			Идентификатор = ОбъектыДляОбработки.Ссылка;
			ДанныеУстройства = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
			ПараметрыОборудования = ДанныеУстройства.Параметры;
			
			Если ПараметрыОборудования.Свойство("ИспользоватьПринтерЧеков") И ПараметрыОборудования.Свойство("ПринтерЧеков") Тогда
				
				Если ПараметрыОборудования.ИспользоватьПринтерЧеков И ЗначениеЗаполнено(ПараметрыОборудования.ПринтерЧеков) Тогда
					Принтеры.Добавить(ПараметрыОборудования.ПринтерЧеков);
				КонецЕсли; 
				
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Принтеры;
	
КонецФункции

#КонецОбласти
